---
kind: property
id: P:Autodesk.Revit.DB.BeamSystem.Profile
source: html/fb63b4c6-1702-538c-01b8-ee622e3e9993.htm
---
# Autodesk.Revit.DB.BeamSystem.Profile Property

Retrieve or set the profile of the BeamSystem.

## Syntax (C#)
```csharp
public CurveArray Profile { get; set; }
```